update products
set description = "    Стильный и надёжный смартфон Apple iPhone X оснащён ультра-производительным процессором А11 Bionic и стабильным программным обеспечением. Полноэкранный дисплей Super Retina с диагональю 5.8 дюйма демонстрирует невероятно яркую, контрастную и живую картинку. Корпус аппарата защищён от воды и пыли.\n    Камера с матрицей 12 Мп, широкоугольным объективом и чувствительной диафрагмой снимает идеально чёткие фотографии и видео, а двойная система оптической стабилизации ещё больше повышает качество изображений. Фронтальная камера на 7 Мп с прогрессивной функцией портретного освещения не только делает красивые селфи, но и помогает обеспечивать безупречный уровень безопасности. Функция Face ID разблокирует устройство после сканирования лица.\n    Корпус полностью выполнен из особенно прочного стекла, усиливающее покрытие которого на 50% толще по сравнению с предыдущими моделями. Благодаря специальному слою с поверхности легко удаляются все загрязнения."
where id = 1;

update products
set description= "    Стильный и надёжный смартфон Apple iPhone X оснащён ультра-производительным процессором А11 Bionic и стабильным программным обеспечением. Полноэкранный дисплей Super Retina с диагональю 5.8 дюйма демонстрирует невероятно яркую, контрастную и живую картинку. Корпус аппарата защищён от воды и пыли.\n    Камера с матрицей 12 Мп, широкоугольным объективом и чувствительной диафрагмой снимает идеально чёткие фотографии и видео, а двойная система оптической стабилизации ещё больше повышает качество изображений. Фронтальная камера на 7 Мп с прогрессивной функцией портретного освещения не только делает красивые селфи, но и помогает обеспечивать безупречный уровень безопасности. Функция Face ID разблокирует устройство после сканирования лица.\n    Корпус полностью выполнен из особенно прочного стекла, усиливающее покрытие которого на 50% толще по сравнению с предыдущими моделями. Благодаря специальному слою с поверхности легко удаляются все загрязнения."
where id = 2;

update products
set description ="    HTC One S имеет 4,3-дюймовый дисплей и 8-МП камеру. На фронтальной панели аппарата расположена дополнительная камера с разрешением 1,3 МП, которая, как и основная, поддерживает HD-запись. Дисплей выполнен по технологии Super AMOLED и имеет разрешение 540 x 960 пикселей. Процессор Qualcomm MSM8260A с частотой 1,5 ГГц. Объем встроенной памяти равен 16 ГБ. "
where id = 3;

update products
set description = "    Смартфон Apple iPhone 5SE 32 ГБ – компактное мобильное устройство, оснащенное 4-дюймовым экраном с высоким (1136x640) разрешением. Дисплей произведен с использованием технологии IPS, позволяющей получить широкие углы обзора и натуральную передачу цветов. Олеофобное покрытие дисплея эффективно противостоит появлению следов от пальцев. Корпус смартфона изготовлен из металла, и отличается высокой стойкостью к механическим воздействиям. Смартфон рассчитан на установку одной SIM-карты. Предусмотренная поддержка LTE дает возможность использовать скоростное мобильное интернет-соединение.\n    Смартфон Apple iPhone SE обладает производительностью, достаточной для комфортного использования любых стандартных приложений. Высокий уровень быстродействия модели обеспечивают 2-ядерный процессор Apple A9, 2 ГБ оперативной памяти и графический ускоритель PowerVR GT7600. Объем встроенной памяти равен 32 ГБ. 12-мегапиксельная камера с пятилинзовой оптикой обеспечивает высокое качество съемки как фото, так и видео. Дизайн модели оформлен с помощью эффектного золотистого цвета."
where id = 4;

update products
set name = "Beats Fit Pro"
where id = 5;

update products
set description = "    Beats Fit Pro — это по-настоящему беспроводные вставные наушники с шумоподавлением, которые всегда останутся на месте, чем бы ты ни занимался в течение дня. Beats Fit Pro оснащены удобными гибкими заушными креплениями. Эффективность универсального дизайна этих креплений тестировали спортсмены, занимающиеся разными видами спорта. Можете не сомневаться: наушники останутся на месте как во время работы, так и тренировок. А благодаря специальным отверстиям, которые выравнивают давление, эти наушники можно без дискомфорта носить весь день, не снимая."
where id = 5;

update products
set name= "GoPro HERO5"
where id = 6;

update products
set description = "    Камера GoPro HERO5 – модель от производителя, которого можно назвать, без преувеличения, легендарным. Камера порадует вас не только высочайшим уровнем качества съемки видео и фото, но и удобством использования. Устройство оборудовано сенсорным дисплеем, размер диагонали которого составляет 2.27 дюйма. Функциональность камеры расширена благодаря возможности исполнения роли веб-камеры.\n    Экшн-камера GoPro HERO5 Black Edition оснащена 23.6-мегапиксельной матрицей, гарантирующей разрешение видео до 5120x2160. Данное разрешение соответствует формату 5.3K. Частота кадров при максимальном разрешении высока: величина этого показателя составляет 30 кадров в секунду. Соответствующий показатель для разрешения FHD – 240 кадров в секунду.\n    Камера соответствует классу защиты IPX8. Возможно погружение устройства на глубину до 10 м. Используемые носители информации – microSD, с объемом до 256 ГБ. Встроенная память отсутствует. В комплектацию камеры входят аккумулятор, кабель USB-C, клеящееся крепление, крепежная пряжка, крепежный винт и футляр."
where id = 6;

update products
set name = "Panasonic HC-V770"
where id = 7;

update products
set description = "    Видеокамера Panasonic HC-V770 сохраняет четкость и естественность теплоты ваших воспоминаний в формате Full HD. Даже при ярком освещении позади объекта у вас получатся насыщенные и детализированные сцены. Благодаря системе независимого управления группами линз, уменьшаются диапазоны привода, а вместе с тем и габариты корпуса. BSI-сенсор и мощный процессор моментально обрабатывают изображение, сглаживая шумы и другие заметные изъяны. Камера имеет внутренние интеллектуальные режимы съемки, подстраивающиеся под тип сюжета. Управление всеми функциями производится в интуитивном меню посредством сенсорного дисплея. Встроенный модуль Wi-Fi позволяет не просто обмениваться материалами по беспроводной сети, но и подключать дополнительные устройства для параллельной съемки нескольких ракурсов. С такой технологией Panasonic HC-V770 может служить радионяней и средством домашнего мониторинга, а также передавать сигнал в условиях прямой трансляции контента на сервер."
where id = 7;

update products
set name = "Delonghi ECAM 22.110"
where id = 8;

update products
set description = "    Удобная и функциональная кофемашина Delonghi ECAM 22.110. B олицетворяет собой пример того, какой должна быть кофемашина. Благодаря отличному сочетанию качества, простоты эксплуатации и надежности данная модель будет радовать вас ароматными напитками долгие годы. Кофемашина может приготовить эспрессо в автоматическом режиме, а также капучино в ручном режиме. Устройство имеет мощность 1450 Вт и давление 15 бар. Среди полезных функций есть автоматическое выключение после нескольких часов непрерывной работы, удаление накипи и прогон горячей воды для самоочистки. Объем резервуара для воды — 1.8 литра, а емкость чаши для зерен — 250 г. Устройство подачи кофе регулируется по высоте от 86 до 142 мм, что позволяет наливать кофе в любую чашку.\n    Модель Delonghi ECAM 22.110.B отличается 13 степенями помола, а приготовление одновременно не одной, а двух чашек кофе сэкономит ваше время. Среди дополнительных функций есть возможность контролировать количество кофе и воды на порцию, а также задать температуру."
where id = 8;

update products
set name ="Haier CEF535ASD"
where id = 9;

update products
set description="    Холодильник Haier CEF535ASD с технологией охлаждения морозильного и холодильного отделения No Frost обеспечивает качественное хранение различных продуктов. Он обладает общим полезным объемом 346 литров. В модели Haier CEF535ASD реализованы режимы ускоренного охлаждения и замораживания, а также режим «Отпуск».\n    Звуковой сигнал оповещает о незакрытой дверце. На передней стороне имеется электронная панель, с помощью которой можно управлять доступными режимами и температурой внутри камер. Светодиодная подсветка ярко освещает пространство охлаждающей камеры и отличается экономичностью."
where id = 9;

update products
set name="Moulinex LM355810"
where id = 10;

update products
set description="    Блендер Moulinex LM355810 представляет собой многофункционального домашнего ассистента, с использованием которого в домашней коллекции блюд появится куда больше кулинарных творений. Все, что от вас потребуется, так это поместить ингредиенты в основную емкость объемом 1.25 л, а после подобрать наиболее подходящий среди 2 скоростных режимов. Спустя считанные секунды прибор справится с их тщательным измельчением или взбиванием.\n    Для создания чаши блендера Moulinex LM355810 использовался первоклассный пластик, устойчивый к впитыванию запахов и воздействию на пищевые свойства продуктов. С этим устройством вы гарантированно удивите домочадцев и впечатлите приглашенных легкими десертами, оригинальными соусами и начинками к блюдам, а также освежающими и витаминными коктейлями. Настоящей палочкой-выручалочкой при точном воспроизведении рецептов станет мерный стакан из комплекта. Дополнительным плюсом является возможность очистки съемных элементов в посудомоечной машине."
where id = 10;

update products
set name="Bosch MFW 68640"
where id = 11;

update products
set description="    Питаете слабость к домашним котлетам, голубцам и колбасам? Тогда вам просто необходимо пополнить арсенал помощников мясорубкой электрической Bosch MFW 68640, которая комплектуется множеством различных насадок. Кроме того, этому прибору вы сможете поручить нарезку и шинковку овощей для последующего приготовления салатов, а также заготовок.\n    Мясорубка электрическая Bosch MFW 68640 отличается высокой производительностью, ведь за минуту ей под силу обработать до 4.3 кг продуктов. Система реверса станет настоящей палочкой-выручалочкой при необходимости устранить застрявшие кусочки жилистого мяса. При создании лотка производитель задействовал первоклассный металл, который не окисляется и не вступает в реакции с ингредиентами. Используя специальный толкатель, не придется нарезать овощи и мясо мелкими кусочками."
where id = 11;